/******************************************************************************************************
* Copyright (c) 2013
* 文件名:
* 创建人: 王一凡
* 日　期: 2013/09/12
* 修改人:
* 日　期:
* 描　述:
* 版　本: Version 1.0
*****************************************************************************************************/
#include <stdio.h>
#include <string.h>
#include "Base.h"
#include "RemotCtrl.h"
#include "DataItem.h"
#include "Gb07.h"
#include "Gb97.h"
#include "Meter645.h"
#include "SysRes.h"
#include "Fun.h"
#include "SoftTimer.h"

/********************************************************************************
* 函数名:RmotCtrlTask
* 输　入:
* 输　出:
* 返  回:
* 功  能: 遥控
*********************************************************************************/
INT8S RmotCtrlInit(void)
{
    return 0;
}

/********************************************************************************
* 函数名:RmotCtrlTask
* 输　入:
* 输　出:
* 返  回:
* 功  能: 遥控
*********************************************************************************/
void RmotCtrlTask(void *pData)
{
    if (RmotCtrlInit() < 0)
	{
		return;
	}
	for (; ;)
	{
        OSTimeDlyHMSM(0, 0, 1, 0);
        RmotCtrlProc();
	}
}












