/******************************************************************************************************
* 2013-2014 益邦科技有限公司
* 文件名: 
* 创建人: 王一凡
* 日　期: 2013/09/21
* 修改人: 
* 日　期: 
* 描　述: 
* 版　本: V1.0
*****************************************************************************************************/
#include "IntProc.h"
#include "AppCfg.h"
#include "Macro.h"
#include "Table.h"
#include "SysRes.h"
#include "TimerCount.h"
#include "PulseCol.h"

/**************************************************************************************************
                                          相关全局变量实现
***************************************************************************************************/
static INT8U  g_nKeyMSecTimer   = 0xFF;				//按键Ms计时器
static INT8U  g_nMSecTimer      = 0xFF;               	//100ms计时器
static INT8U  g_nSecTimer       = 0xFF;            	//1s计时器

/**************************************************************************************************
                                           相关函数实现
***************************************************************************************************/

/********************************************************************************
* 函数名:
* 输　入:
* 输　出:
* 返  回:
* 功  能: 中断任务处理
*********************************************************************************/
void IntProc(void)
{
    IntTimerProc();
}

/********************************************************************************
* 函数名:
* 输　入:
* 输　出:
* 返  回:
* 功  能: 中断计时处理
*********************************************************************************/
void IntTimerProc(void)
{
    //脉冲采集任务
#if (PUL_CALC_FUNC_EN == 1)
    PulseColNumProc();  
#endif
	if (++g_nKeyMSecTimer >= 2)
	{
		g_nKeyMSecTimer = 0;
		OSSemPost(g_pSem[SEM_10MSEC_IDX]);	
	}
	if (++g_nMSecTimer >= 10)	//毫秒级任务
	{
		g_nMSecTimer = 0;
		OSSemPost(g_pSem[SEM_MSEC_IDX]);			
	}
	
	if (++g_nSecTimer >= 100)	//秒级任务
	{
		g_nSecTimer = 0;
		TimerCtrlProc(0);
		OSSemPost(g_pSem[SEM_SEC_IDX]);
        #if AC_FUNC_EN == 1
        OSSemPost(g_pSem[SEM_COL_AC_CALC_IDX]);    /*交采采集计算任务*/
        #endif
	}
}
