/*
**********************************************************************
*
*                  监控系统8.0__嵌入式系统构件
*
**********************************************************************

----------------------------------------------------------------------
文 件 名	: sys_data.h
文件描述	: 数据类型定义
创建作者	: HCF
创建日期	: 2007.03.13
======================================================================
版本历史	:
----------------------------------------------------------------------
修改日期	:
修改内容	:
======================================================================
*/
#ifndef _SYS_DATA_H_
#define _SYS_DATA_H_

#ifndef TRUE
#define TRUE	1
#endif
#ifndef FALSE
#define FALSE	0
#endif
#ifndef NULL
#define	NULL	(void *)0
#endif

#define SYS_TRUE	TRUE
#define SYS_FALSE	FALSE


/*
**********************************************************************
*						以下定义与编译器相关
**********************************************************************/
typedef signed   char		sint8;			// 有符号1个字节
typedef signed   short		sint16;			// 有符号2个字节
typedef signed   int		sint32;			// 有符号4个字节
#endif
