/******************************************************************************************************
* 2013-2014 益邦科技有限公司
* 文件名: 
* 创建人: 王一凡
* 日　期: 2013/09/21
* 修改人: 
* 日　期: 
* 描　述: 
* 版　本: V1.0
*****************************************************************************************************/

#ifndef _POWER_ON_
#define	_POWER_ON_

#include "Os_cpu.h"


/**************************************************************************************************
                                          相关全局变量声明
***************************************************************************************************/
extern INT8U       g_nAcCalPrmInitFlg;

extern INT8U    g_nTriphase;
extern INT8U    g_nSinglephase;

extern INT32U  g_nAcPulseConst;

extern INT32U  g_nVolt;
extern INT8U			g_nHardNo;
extern INT8U  g_nMemAddr[6];
extern INT8U  g_nMemProductAddr[6];
extern INT8U  g_nMem698Addr[6];
//1.单相 2.三相四线220，3.三相四线(57.7) 4.三相三线(100V)，
extern INT32U  g_nHardType;
extern INT8U   DISPLY_SWITCH;
/**************************************************************************************************
                                           相关函数实现
***************************************************************************************************/
//上电处理(需进行喂狗处理)
BOOLEAN PowerOnProc(void);
#endif
