/******************************************************************************************************
* 2013-2014 益邦科技有限公司
* 文件名: 
* 创建人: 王一凡
* 日　期: 2013/09/21
* 修改人: 
* 日　期: 
* 描　述: 
* 版　本: V1.0
*****************************************************************************************************/
#ifndef _RESET_H_
#define _RESET_H_

#include "Os_cpu.h"

extern INT8U   g_nInitType;

/**************************************************************************************************
                                          相关宏定义
***************************************************************************************************/
//初始化操作选项
#define		MEM_INIT_POWER_ON				1			//上电初始化	
#define		MEM_INIT_DATA					2			//数据初始化
#define		MEM_INIT_FACTORY				3			//参数初始化 + 数据初始化(即恢复出厂设置)
#define		MEM_INIT_PART_PRM				4			//参数初始化(除通信参数) + 数据初始化




/**************************************************************************************************
                                           相关函数声明
***************************************************************************************************/
//初始化处理
INT32S MemInit(INT8U nOpt);
INT32S MemPowerOnInit(void);
INT32S MemDataInit(void);
INT32S MemPartPrmInit(void);
INT32S MemFactoryInit(void);

INT32S AcPrmPrmInit(void);
INT32S MemInitAllExt(void);

void AcEnergyInit(void);


#endif
